prime/app/controllers/jojolions_controller.rb

SELECT "jojolions".* FROM "jojolions"
---
  def index
    @jojolions = Jojolion.all

SELECT "jojolions".* FROM "jojolions" WHERE "jojolions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @jojolion = Jojolion.find(params[:id])

INSERT INTO "jojolions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 21 Sep 2012 03:27:37 UTC +00:00], ["updated_at", Fri, 21 Sep 2012 03:27:37 UTC +00:00]]
---
  def create
    @jojolion = Jojolion.new(params[:jojolion])

    respond_to do |format|
      if @jojolion.save