uploda/app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("comment", "content_type", "data", "name") VALUES (?, ?, ?, ?)
---
  def create
    @picture = Picture.new(params[:picture])
    if @picture.save

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "16"]]
---
  def download
    @picture = Picture.find(params[:picture_id])